socialNetwork/jaeger_traces/limit_socnetapp_media-service/traces_0.6.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 4.899ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.759ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.682ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.688ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.718ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.607ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.711ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.422ms, rate sampling interval: 12ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.29ms  606.53us   6.18ms   73.47%
    Req/Sec    25.55     49.05   200.00     76.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.14ms
 75.000%    4.61ms
 90.000%    5.14ms
 99.000%    6.18ms
 99.900%    7.45ms
 99.990%    8.07ms
 99.999%    8.07ms
100.000%    8.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.199     0.000000            1         1.00
       3.673     0.100000          390         1.11
       3.801     0.200000          792         1.25
       3.909     0.300000         1172         1.43
       4.013     0.400000         1563         1.67
       4.143     0.500000         1957         2.00
       4.215     0.550000         2149         2.22
       4.291     0.600000         2339         2.50
       4.391     0.650000         2541         2.86
       4.491     0.700000         2733         3.33
       4.611     0.750000         2936         4.00
       4.667     0.775000         3022         4.44
       4.751     0.800000         3119         5.00
       4.827     0.825000         3219         5.71
       4.919     0.850000         3317         6.67
       5.019     0.875000         3416         8.00
       5.079     0.887500         3463         8.89
       5.147     0.900000         3512        10.00
       5.219     0.912500         3558        11.43
       5.271     0.925000         3608        13.33
       5.355     0.937500         3657        16.00
       5.403     0.943750         3679        17.78
       5.471     0.950000         3706        20.00
       5.535     0.956250         3729        22.86
       5.591     0.962500         3752        26.67
       5.667     0.968750         3777        32.00
       5.711     0.971875         3792        35.56
       5.775     0.975000         3802        40.00
       5.811     0.978125         3814        45.71
       5.863     0.981250         3825        53.33
       5.959     0.984375         3838        64.00
       5.987     0.985938         3844        71.11
       6.079     0.987500         3850        80.00
       6.143     0.989062         3857        91.43
       6.183     0.990625         3862       106.67
       6.259     0.992188         3869       128.00
       6.275     0.992969         3871       142.22
       6.307     0.993750         3874       160.00
       6.363     0.994531         3877       182.86
       6.559     0.995313         3880       213.33
       6.663     0.996094         3883       256.00
       6.763     0.996484         3885       284.44
       6.783     0.996875         3886       320.00
       6.839     0.997266         3888       365.71
       6.907     0.997656         3889       426.67
       6.975     0.998047         3891       512.00
       7.191     0.998242         3892       568.89
       7.191     0.998437         3892       640.00
       7.263     0.998633         3893       731.43
       7.447     0.998828         3894       853.33
       7.599     0.999023         3895      1024.00
       7.599     0.999121         3895      1137.78
       7.599     0.999219         3895      1280.00
       7.611     0.999316         3896      1462.86
       7.611     0.999414         3896      1706.67
       7.747     0.999512         3897      2048.00
       7.747     0.999561         3897      2275.56
       7.747     0.999609         3897      2560.00
       7.747     0.999658         3897      2925.71
       7.747     0.999707         3897      3413.33
       8.075     0.999756         3898      4096.00
       8.075     1.000000         3898          inf
#[Mean    =        4.291, StdDeviation   =        0.607]
#[Max     =        8.072, Total count    =         3898]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5804 requests in 30.12s, 1.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 9596
Requests/sec:    192.69  
Transfer/sec:     40.46KB