socialNetwork/jaeger_traces/limit_socnetapp_media-service/traces_socnetapp_media-service_0.3.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 568.858ms, rate sampling interval: 1905ms
  Thread calibration: mean lat.: 582.757ms, rate sampling interval: 2004ms
  Thread calibration: mean lat.: 461.979ms, rate sampling interval: 1735ms
  Thread calibration: mean lat.: 432.662ms, rate sampling interval: 1462ms
  Thread calibration: mean lat.: 427.770ms, rate sampling interval: 1386ms
  Thread calibration: mean lat.: 362.673ms, rate sampling interval: 1426ms
  Thread calibration: mean lat.: 424.921ms, rate sampling interval: 1525ms
  Thread calibration: mean lat.: 518.185ms, rate sampling interval: 2359ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.77s     3.04s   10.00s    84.07%
    Req/Sec    22.49      4.12    32.00     79.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  267.01ms
 75.000%    1.50s 
 90.000%    7.22s 
 99.000%   10.00s 
 99.900%   14.07s 
 99.990%   16.65s 
 99.999%   16.65s 
100.000%   16.65s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.461     0.000000            1         1.00
      26.447     0.100000          364         1.11
     103.743     0.200000          727         1.25
     152.831     0.300000         1092         1.43
     199.679     0.400000         1454         1.67
     267.007     0.500000         1819         2.00
     302.079     0.550000         2002         2.22
     350.719     0.600000         2181         2.50
     430.335     0.650000         2363         2.86
     561.663     0.700000         2545         3.33
    1501.183     0.750000         2727         4.00
    2347.007     0.775000         2818         4.44
    3336.191     0.800000         2908         5.00
    4259.839     0.825000         3000         5.71
    5152.767     0.850000         3090         6.67
    6139.903     0.875000         3183         8.00
    6742.015     0.887500         3227         8.89
    7217.151     0.900000         3272        10.00
    8048.639     0.912500         3317        11.43
    9084.927     0.925000         3363        13.33
    9535.487     0.937500         3409        16.00
    9641.983     0.943750         3431        17.78
    9740.287     0.950000         3455        20.00
    9887.743     0.956250         3476        22.86
    9936.895     0.962500         3499        26.67
    9977.855     0.968750         3523        32.00
    9994.239     0.971875         3535        35.56
   10002.431     0.975000         3603        40.00
   10002.431     0.978125         3603        45.71
   10002.431     0.981250         3603        53.33
   10002.431     0.984375         3603        64.00
   10002.431     0.985938         3603        71.11
   10002.431     0.987500         3603        80.00
   10002.431     0.989062         3603        91.43
   10002.431     0.990625         3603       106.67
   10010.623     0.992188         3617       128.00
   10010.623     0.992969         3617       142.22
   10010.623     0.993750         3617       160.00
   10010.623     0.994531         3617       182.86
   10125.311     0.995313         3618       213.33
   10633.215     0.996094         3621       256.00
   10821.631     0.996484         3623       284.44
   11263.999     0.996875         3624       320.00
   11640.831     0.997266         3626       365.71
   11698.175     0.997656         3627       426.67
   12558.335     0.998047         3628       512.00
   13303.807     0.998242         3629       568.89
   13631.487     0.998437         3630       640.00
   14073.855     0.998633         3631       731.43
   14073.855     0.998828         3631       853.33
   14532.607     0.999023         3632      1024.00
   14532.607     0.999121         3632      1137.78
   14581.759     0.999219         3633      1280.00
   14581.759     0.999316         3633      1462.86
   14581.759     0.999414         3633      1706.67
   16375.807     0.999512         3634      2048.00
   16375.807     0.999561         3634      2275.56
   16375.807     0.999609         3634      2560.00
   16375.807     0.999658         3634      2925.71
   16375.807     0.999707         3634      3413.33
   16654.335     0.999756         3635      4096.00
   16654.335     1.000000         3635          inf
#[Mean    =     1765.048, StdDeviation   =     3040.939]
#[Max     =    16646.144, Total count    =         3635]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5212 requests in 30.09s, 1.08MB read
  Socket errors: connect 0, read 0, write 0, timeout 9507
  Non-2xx or 3xx responses: 86
Requests/sec:    173.22  
Transfer/sec:     36.66KB